#include <iostream> 
using namespace std;

int main() {
	string A[5000];
	int k,n;
	cin >> n;
	A[0] = '.';
	//Нужно что-то сделать  точкой, которая отделяет десяток от правой цифры
	A[1] = 'I';
	A[2] = A[1] + A[1];
	A[3] = A[2] + A[1];
	A[5] = 'V';
	A[4] = A[1] + A[5];
	A[6] = A[5] + A[1];
	for (int i = 6; i < 9; ++i)
		A[i] = A[i - 1] + A[1];
	A[10] = 'X';
	A[9] = A[1] + A[10];
	A[20] = A[10] + A[10];
	A[30] = A[20] + A[10];
	A[50] = 'L';
	A[40] = A[10] + A[50];
	A[100] = 'C';
	A[90] = A[10] + A[100];
	//Десятки
	for (int i = 6; i < 9; ++i)	A[i * 10] = A[50] + A[10 * (i - 5)];
	//сотни до 400
	for (int i = 2; i < 4; ++i)	A[i * 100] = A[100] + A[100 * (i - 1)];
	A[500] = 'D';
	A[400] = A[100] + A[500];
	//сотни до 900
	for (int i = 6; i < 9; ++i)	A[i * 100] = A[500] + A[100 * (i - 5)];
	A[1000] = 'M';
	A[900] = A[100] + A[1000];
	//тысячи до 4000
	for (int i = 2; i < 4; ++i)	A[i * 1000] = A[1000] + A[1000 * (i - 1)];

	for (int i = 11; i < 100; ++i) {
		A[i] = A[(i/10)*10] + A[i % 10];
	}
	for (int i = 101; i < 400; ++i) {
		A[i] = A[(i/100)*100] + A[i % 100];
	}
	for (int i = 401; i < 1000; ++i) {
		A[i] = A[(i / 100) * 100] + A[i % 100];
	}
	for (int i = 1001; i < 4000; ++i) {
		A[i] = A[(i / 1000) * 1000] + A[i % 1000];
	}

	cout << A[n] << endl;

	return 0;

}
